# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash'
brew 'bat'
brew 'bitwarden-cli'
brew 'coreutils'
brew 'croc'
brew 'fish'
brew 'gh'
brew 'ghostscript'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'graphviz'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'mongodb-community-shell'
brew 'neofetch'
brew 'pinentry-mac'
brew 'r'
brew 'starship'
brew 'yt-dlp'

# Development
brew 'openjdk'
brew 'openjdk@11'
brew 'perl'

# Apps
cask 'adobe-acrobat-pro'
cask 'aerial'
cask 'alacritty'
cask 'alt-tab'
cask 'appcleaner'
cask 'bitwarden'
cask 'cleanshot'
cask 'devutils'
cask 'discord'
cask 'dozer'
cask 'fantastical'
cask 'google-drive'
cask 'imageoptim'
cask 'intellij-idea'
cask 'keka'
cask 'mactex-no-gui'
cask 'microsoft-edge'
cask 'microsoft-excel'
cask 'microsoft-word'
cask 'miniconda'
cask 'mission-control-plus'
cask 'mongodb-compass'
cask 'mos'
cask 'notion'
cask 'postico'
cask 'rapidapi'
cask 'raycast'
cask 'readdle-spark'
cask 'sidenotes'
cask 'slack'
cask 'spotify'
cask 'stats'
cask 'swish'
cask 'telegram-desktop'
cask 'tor-browser'
cask 'tower'
cask 'transmit'
cask 'transocks'
cask 'typora'
cask 'upic'
cask 'utm'
cask 'via'
cask 'visual-studio-code'
cask 'wechat'
cask 'wechattweak-cli'
cask 'yesplaymusic'
cask 'zoom'

# Fonts
cask 'font-caskaydia-cove-nerd-font'
cask 'font-fira-code'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Dropover', id: 1355679052
mas 'Irvue', id: 1039633667
mas 'Keynote', id: 409183694
mas 'Pixelmator Pro', id: 1289583905
mas 'Pages', id: 409201541
mas 'Ulysses | Writing App', id: 1225570693
